tutorials/Hydrodynamics/JBC/run/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.179 0 0);

boundaryField
{
    
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    back
    {
        type            slip;
    }
    front
    {
        type            slip;
    }
    top
    {
        type            symmetry;
    }
    bot
    {
        type            slip;
    }
    hull
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
}


// ************************************************************************* //
