tutorials/Hydrodynamics/JBC/run/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p;
}
dimensions [ 0 2 -2 0 0 0 0 ];
internalField uniform 0.0;

boundaryField
{

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    back
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetry;
    }
    bot
    {
        type            zeroGradient;
    }
    hull
    {
        type            zeroGradient;
    }

}
